#include "hstring.h"
#include "frank_alloc.h"
#include <iostream>

int main(void)
{
    using namespace std;
    /*1.重载+ 增加数据,增加数据要实现的形态: “123456789” + “abc”  得到 “123456789abc”*/
    hstring str1("123456789");
    cout<<"=======================1========================\n";
    cout<<str1+"abc"<<endl;
    cout<<"================================================\n\n\n";

    /*2.重载- 删除数据,增加数据要实现的形态:”123456789” - “456”  得到 “123789”*/
    cout<<"=======================2========================\n";
    cout<<str1-"456"<<endl;
    hstring str2("456");
    cout<<str1-str2<<endl;
    cout<<"================================================\n\n\n";

    /*3.改数据 ,要求  “123456789”  34修改为 abc 得到 12abc56789*/
    cout<<"=======================3========================\n";
    cout<<str1.replace("34","abc")<<endl;
    cout<<"================================================\n\n\n";

    /*4.查 ,123456 差 34 得到 34的位置 2*/
    cout<<"=======================4========================\n";
    hstring str3("123456");
    cout<<str3.find("34")<<endl;
    cout<<"================================================\n\n\n";

    /*5.重载 = 实现 int 转 hstring 字符串*/
    cout<<"=======================5========================\n";
    hstring str4("abc");
    str4 = 123456789;
    cout<<str4<<endl;
    cout<<"================================================\n\n\n";


}